#
# Copyright (C) 2021-2022 by TeamYukki@Github, < https://github.com/TeamYukki >.
#
# This file is part of < https://github.com/TeamYukki/YukkiMusicBot > project,
# and is released under the "GNU v3.0 License Agreement".
# Please see < https://github.com/TeamYukki/YukkiMusicBot/blob/master/LICENSE >
#
# All rights reserved.

HELP_1 = """**⩹━★⊷━𝐒𝐎𝐔𝐑𝐂𝐄 𝐕𝐄𝐆𝐀━⊶★━⩺**

✅ اليك قائمة اوامر الادمن ,

★ جميع الاوامر خاصه ب الادمن فقط .

★ لعرض سرعه البوت اكتب : بنج .
★ للتحكم في لغه البوت اكتب : /اللغه .
★ لعرض اعدادات البوت اكتب : الاعدادات .

★ ثانيا اليك اوامر الرتب .

★ لرفع ادمن في الجروب اكتب : رفع مطور . 
★ لتنزيل ادمن في الجروب اكتب : تنزيل مطور . 
★ لعرض قائمه الادمنيه اكتب : المطورين .

★ ثالثا اليك اوامر الحظر .

★ لحظر عضو من الجروب اكتب : حظر ميوزك. 
★ لالغاء حظر عضو من الجروب اكتب : الغاء حظر. 
★ لعرض قائمه المحظورين اكتب : المحظورين
\n\n**⩹━★⊷━𝐒𝐎𝐔𝐑𝐂𝐄 𝐕𝐄𝐆𝐀━⊶★━⩺**"""


HELP_2 = """**⩹━★⊷━𝐒𝐎𝐔𝐑𝐂𝐄 𝐕𝐄𝐆𝐀━⊶★━⩺**

اليك قائمة اوامر التشغيل فالجروب او القناه✅

★ لتشغيل اغنيه اكتب : تشغيل او شغل او /play
★ لتشغيل فيديو اكتب : /vplay او فيديو او فديو
★ لأنهاء الاغنيه اكتب : انهاء او اسكت او ايقاف /end
★ لايقاف الاغنيه مؤقت اكتب : وقف او توقف او /pause
★ لتكملة الاغنيه من الايقاف المؤقت اكتب : كمل او استئناف او /resume
★ لتخطي الاغنيه اكتب : تخطي او /skip
★ لكتم البوت في الكول اكتب : ميوت او /mute
★ لألغاء كتم البوت في الكول اكتب : فك ميوت او /unmute
★ لاعادة تشغيل البوت اكتب : ريستارت او /restart 
★ لمعرفه كلمات اي اغنيه : /lyrics او كلمات
★ لتحميل موسيقي او فيديو : /song او تحميل او اغنيه
★ لمعرفه الاغاني الموجوده في قائمه الانتظار : /queue
★ لعرض سرعه البوت : بنج او /ping
★ لتحويل لغه البوت : اللغه او /lang او language\n\n**⩹━★⊷━𝐒𝐎𝐔𝐑𝐂𝐄 𝐕𝐄𝐆𝐀━⊶★━⩺**"""


HELP_3 = """**⩹━★⊷━𝐒𝐎𝐔𝐑𝐂𝐄 𝐕𝐄𝐆𝐀━⊶★━⩺**\n\n
/ stats - احصل على أفضل 10 مسارات للإحصاءات العالمية ، وأعلى 10 مستخدمين للروبوت ، وأفضل 10 محادثات على الروبوت ، وأفضل 10 تم لعبها في محادثة ، إلخ.

/ sudolist - تحقق من مستخدمي Sudo لـ Yukki Music Bot

/ كلمات الأغاني [اسم الموسيقى] - يبحث في كلمات الأغاني الخاصة بالموسيقى على الويب.

/ song [اسم المسار] أو [رابط YT] - قم بتنزيل أي مقطع صوتي من youtube بتنسيقات mp3 أو mp4.

/ لاعب - احصل على لوحة لعب تفاعلية.

c لتقف على قناة اللعب.

/ queue أو / cqueue- تحقق من قائمة انتظار الموسيقى.
\n\n**⩹━★⊷━𝐒𝐎𝐔𝐑𝐂𝐄 𝐕𝐄𝐆𝐀━⊶★━⩺**"""

HELP_4 = """**⩹━★⊷━𝐒𝐎𝐔𝐑𝐂𝐄 𝐕𝐄𝐆𝐀━⊶★━⩺**\n\n
✅ اوامر تشغيل البوت في القناه

★ قم برفع البوت مشرف بالقناه وبالجروب
او 
★ قم بي رفع البوت في القناه و شغل مباشر
★ استخدم /channelplay او ربط + معرف القناه للربط

★ ثم استخدم الاوامر بالاسفل للتشغيل

★ تشغيل مباشر في القناه

★ لتشغيل اغنيه اكتب : تشغيل او شغل او /play
★ لتشغيل فيديو اكتب : /vplay : فيديو : فديو
★ لأنهاء الاغنيه اكتب : ايقاف او اسكت او /end
★ لايقاف الاغنيه مؤقت اكتب : وقف او توقف او /pause
★ لتكملة الاغنيه من الايقاف المؤقت اكتب : كمل او استئناف او /resume
★ لتخطي الاغنيه اكتب : تخطي او /skip
★ لكتم البوت في الكول اكتب : ميوت او /mute
★ لألغاء كتم البوت في الكول اكتب : فك ميوت او /unmute

★ لتشغيل اغنيه : /cplay
★ لتشغيل فيديو : /cvplay
★ لأنهاء الاغنيه  : /cstop
★ لايقاف الاغنيه مؤقت : /cpause
★ لتكملة الاغنيه  : /cresume
★ لتخطي الاغنيه : /cskip
★ لكتم البوت في الكول  : /cmute
★ لألغاء كتم البوت في الكول  :  /cunmute

★ لتقديم الاغنيه للامام /seek و الرقم
مثال : /seek 10 تقديم عشر ثواني
★ لارجاع للخلف /seekback و الرقم 
\n\n**⩹━★⊷━𝐒𝐎𝐔𝐑𝐂𝐄 𝐕𝐄𝐆𝐀━⊶★━⩺**"""

HELP_5 = """**⩹━★⊷━𝐒𝐎𝐔𝐑𝐂𝐄 𝐕𝐄𝐆𝐀━⊶★━⩺**\n\n
★قايمه مميزات سورس فيجا 

★ميزه ⦂ المطور بيجيب المطور البوت 
★ميزه ⦂ تبيه بفتح+قفل الكول
★ميزه ⦂ ترحيب دخول و خروج الاعضاء 
★ميزه ⦂ جروب بيجيب الجروب+الرابط+ايدي
★ميزه ⦂ قول البوت بيقول بالكلمه اللي بتقولها 
★ميزه ⦂ الالعاب +كت+تويت+العاب متطوره
★ميزه ⦂ تلغراف ميديا بردعالصوره
★ميزه ⦂ ايدي بالرد بالصوره
★ميزه ⦂ جمالي برد بالصوره ونسبه
★ميزه ⦂ اذاعه خاص+بالتثبيت+بالمساعد+عام
★ميزه ⦂ الصوتيه..ف كول
★ميزه ⦂ نزول تلقائي للمساعد لعدم وجود حد فالكول
★ميزه ⦂ بث مباشر للقنوات 
★ميزه ⦂ اسمي بيجب الاسم
★ميزه ⦂ سورس بيجب السورس
★ميزه ⦂ حظر+كتم ميوزك
★ميزه ⦂ كشف
★ميزه ⦂ تاك لكل الاعضاء
★ميزه ⦂ انا مين
★ميزه ⦂ رتبتي
★ميزه ⦂ مبرمج
★ميزه ⦂ المنشئ+المالك
★ميزه ⦂ الاحصائيات
★ميزه ⦂ كيب المطور من خلاله تتحكم في الحساب المساعد
★ميزه ⦂ الاذكار
★ميزه ⦂ تبيه بوقت صلاه
★ميزه ⦂ دعوه في كول
★ميزه ⦂  دعوه فالخاص بتاع البوت
★ميزه ⦂ تنبيه..بانضمام بوت في الجروبات
★ميزه ⦂ غنيلي 
★ميزه ⦂ بايو
★ميزه ⦂ خروج المساعد من جروبات لعدم تقطيع صوت..البوت
★ميزه ⦂ اسال/اصراحه
★ميزه ⦂ نكت
★ميزه ⦂ زخرفه 
★ميزه ⦂ مميزات. بيجبلك مميزات موجوده فسورس 
★ميزه ⦂ رفع و تنزيل مطور\n\n**⩹━★⊷━𝐒𝐎𝐔𝐑𝐂𝐄 𝐕𝐄𝐆𝐀━⊶★━⩺**"""
